sroggerini/SCU_FW_Develop/Src/Device/ExtFlash_stm32h5.c
    /* Transmit a DUMMY byte and read the status register */
    if (sFLASH_SendReceiveByte(sFLASH_DUMMY_BYTE, (uint8_t *)&StatusReg) != HAL_OK)
    {
      return HAL_ERROR;
    } 
    
    /* Put NSS to HIGH level */
    NSS_TO_HIGH_LEVEL
      
    /* Check if timeout is expired */
    if((HAL_GetTick() - tickstart ) > Timeout)
    {        
      return HAL_TIMEOUT;
    }
          
    /* Check Status register if WIP flag is set --> an operation is in progress */
  } while((StatusReg & sFLASH_STATUS_REG_WIP_MASK) != 0);
    
  return HAL_OK;
}

/**
  * @brief  Reads an amount of data from the QSPI memory.
  * @param  pData: Pointer to data to be read
  * @param  ReadAddr: Read start address
  * @param  Size: Size of data to read
  * @retval QSPI memory status
  */
static uint8_t sFLASH_Read(uint8_t* pData, uint32_t ReadAddr, uint32_t Size)
{
    
  if ((ReadAddr >= sFLASH_Information.FlashSize) || ((ReadAddr + Size) > sFLASH_Information.FlashSize))
  {
    /* address out of range */
    return HAL_ERROR;
  }
  
  /* Put NSS to LOW level */
  NSS_TO_LOW_LEVEL  

    /* Transmit command used to read the device content */
  if (sFLASH_SendByte(READ_CMD) != HAL_OK)
  {
    return HAL_ERROR;
  }
  /* Transmit the address of the data to be read (1st byte) */  
  if (sFLASH_SendByte((ReadAddr & 0xFF0000) >> 16) != HAL_OK)
  {
    return HAL_ERROR;
  }
  /* Transmit the address of the data to be read (2nd byte) */  
  if (sFLASH_SendByte((ReadAddr & 0xFF00) >> 8) != HAL_OK)
  {
    return HAL_ERROR;
  }
  /* Transmit the address of the data to be read (3rd byte) */  
  if (sFLASH_SendByte(ReadAddr & 0xFF) != HAL_OK)
  {
    return HAL_ERROR;
  }
  /* Receive data */
  if (sFLASH_ReceiveData(pData, Size) != HAL_OK)
  {
    return HAL_ERROR;
  }
 
  /* Put NSS to HIGH level */
  NSS_TO_HIGH_LEVEL  
    
  return HAL_OK;
}

/**
  * @brief  Writes an amount of data to the QSPI memory.
  * @param  pData: Pointer to data to be written
  * @param  WriteAddr: Write start address
  * @param  Size: Size of data to write
  * @retval QSPI memory status
  */
static uint8_t sFLASH_Write(uint8_t* pData, uint32_t WriteAddr, uint32_t Size)
{
    
  uint32_t end_addr, current_size, current_addr;

  if ((WriteAddr >= sFLASH_Information.FlashSize) || ((WriteAddr + Size) > sFLASH_Information.FlashSize))
  {
    /* address out of range */
    return HAL_ERROR;
  }

  /* Calculation of the size between the write address and the end of the page */
  current_addr = 0;

  while (current_addr <= WriteAddr)
  {
    current_addr += sFLASH_Information.ProgPageSize;
  }

  current_size = current_addr - WriteAddr;

  /* Check if the size of the data is less than the remaining place in the page */
  if (current_size > Size)
  {
    current_size = Size;
  }

  /* Initialize the address variables */
  current_addr = WriteAddr;
  end_addr = WriteAddr + Size;
  
  do
  {
       
    /* Before any page program operation, a Write enable command must be performed */
    if (sFLASH_WriteEnable() != HAL_OK)
    {     
      return HAL_ERROR;    
    }

    /* Put NSS to LOW level */
    NSS_TO_LOW_LEVEL  
      
    /* Send Page Program command */
    if (sFLASH_SendByte(PAGE_PROG_CMD) != HAL_OK)   
    {
      return HAL_ERROR;
    }
    /* Send the address of the location to write (1st byte) */
    if (sFLASH_SendByte((current_addr & 0xFF0000) >> 16) != HAL_OK)
    {
      return HAL_ERROR;
    }
    /* Send the address of the location to write (2nd byte) */
    if (sFLASH_SendByte((current_addr & 0xFF00) >> 8) != HAL_OK)
    {
      return HAL_ERROR;
    }
    /* Send the address of the location to write (3rd byte) */
    if (sFLASH_SendByte(current_addr & 0xFF) != HAL_OK)
    {
      return HAL_ERROR;
    }
    /* Send the data to write */  
    if (sFLASH_TransmitData(pData, current_size) != HAL_OK)
    {
      return HAL_ERROR;
    } 
    
    /* Put NSS to HIGH level */
    NSS_TO_HIGH_LEVEL
    
    /* Configure automatic polling mode to wait for end of program */
    if (sFLASH_WaitForWriteInProgress(SPI_TIMEOUT_VALUE) != HAL_OK)
    {
      return HAL_ERROR;
    }
    
    /* Update the address and size variables for next page programming */
    current_addr += current_size;
    pData += current_size;
    current_size = ((current_addr + sFLASH_Information.ProgPageSize) > end_addr) ? (end_addr - current_addr) : sFLASH_Information.ProgPageSize;

  }
  while (current_addr < end_addr);
  
  return HAL_OK;
}


/**
  * @brief  Erases the specified block of the QSPI memory.
  * @param  BlockAddress: Block address to erase
  * @retval QSPI memory status
  */
uint8_t sFLASH_Erase_Block(uint32_t BlockAddress)
{
  
  /* Send Write enable command */
  if (sFLASH_WriteEnable() != HAL_OK)
  {
    return HAL_ERROR;    
  }
  
  /* Put NSS to LOW level */
  NSS_TO_LOW_LEVEL  
    
  /* Transmit command used to erase a sector */
  if (sFLASH_SendByte(SECTOR_ERASE_CMD) != HAL_OK)
  {
    return HAL_ERROR;
  }
  /* Send the address of the location that need to be erased (1st byte)*/
  if (sFLASH_SendByte((BlockAddress & 0xFF0000) >> 16) != HAL_OK)
  {
    return HAL_ERROR;
  }
  /* Send the address of the location that need to be erased (2nd byte)*/
  if (sFLASH_SendByte((BlockAddress & 0xFF00) >> 8) != HAL_OK)
  {
    return HAL_ERROR;
  }
  /* Send the address of the location that need to be erased (3rd byte)*/
  if (sFLASH_SendByte(BlockAddress & 0xFF0) != HAL_OK)
  {
    return HAL_ERROR;
  }
  
  /* Put NSS to HIGH level */
  NSS_TO_HIGH_LEVEL
  
  /* Read the status register to poll the WIP flag */
  if (sFLASH_WaitForWriteInProgress(FLASH_SUBSECTOR_ERASE_MAX_TIME) != HAL_OK)
  {
    return HAL_ERROR;
  }
    
  return HAL_OK;
  
}

/**
  * @brief  Erases the specified sub-block of the QSPI memory.
  * @param  BlockAddress: Block address to erase
  * @retval QSPI memory status
  */
static uint8_t sFLASH_Erase_SubBlock(uint32_t BlockAddress)
{
  
  /* Send Write enable command */
  if (sFLASH_WriteEnable() != HAL_OK)
  {
    return HAL_ERROR;    
  }
  
  /* Put NSS to LOW level */
  NSS_TO_LOW_LEVEL  
    
  /* Transmit command used to erase a sector */
  if (sFLASH_SendByte(SECTOR_4K_ERASE_CMD) != HAL_OK)
  {
    return HAL_ERROR;
  }
  /* Send the address of the location that need to be erased (1st byte)*/
  if (sFLASH_SendByte((BlockAddress & 0xFF0000) >> 16) != HAL_OK)
  {
    return HAL_ERROR;
  }
  /* Send the address of the location that need to be erased (2nd byte)*/
  if (sFLASH_SendByte((BlockAddress & 0xFF00) >> 8) != HAL_OK)
  {
    return HAL_ERROR;
  }
  /* Send the address of the location that need to be erased (3rd byte)*/
  if (sFLASH_SendByte(BlockAddress & 0xFF0) != HAL_OK)
  {
    return HAL_ERROR;
  }
  
  /* Put NSS to HIGH level */
  NSS_TO_HIGH_LEVEL
   
