sroggerini/SCU_FW_Develop/Src/Device/ExtFlash_stm32h5.c
  /* Read the status register to poll the WIP flag */
  if (sFLASH_WaitForWriteInProgress(FLASH_SUBSECTOR_ERASE_MAX_TIME) != HAL_OK)
  {
    return HAL_ERROR;
  }
    
  return HAL_OK;

}

/**
  * @brief  Reads current status register 1 of the QSPI memory.
  * @retval QSPI status register 1
  */
static uint8_t sFLASH_GetStatusReg1(uint8_t *reg)
{
   
  /* Put NSS to LOW level */
  NSS_TO_LOW_LEVEL  
    
  /* Transmit command  */
  if (sFLASH_SendByte(READ_STATUS_REG_CMD) != HAL_OK)
  {
    return HAL_ERROR;
  }  
    
  /* Transmit a DUMMY byte so I can read the status register */
  if (sFLASH_SendReceiveByte(sFLASH_DUMMY_BYTE, reg) != HAL_OK)
  {
    return HAL_ERROR;
  } 

  /* Put NSS to HIGH level */
  NSS_TO_HIGH_LEVEL
    
  return HAL_OK;

}

/**
  * @brief  Reads current configuration register 1 of the QSPI memory.
  * @retval QSPI configuration register 1
  */
static uint8_t sFLASH_GetConfigReg1(uint8_t *reg)
{
  
  /* Put NSS to LOW level */
  NSS_TO_LOW_LEVEL  
    
  /* Transmit command  */
  if (sFLASH_SendByte(READ_FUNCTION_REG_CMD) != HAL_OK)
  {
    return HAL_ERROR;
  } 
    
  /* Transmit a DUMMY byte so I can read the status register */
  if (sFLASH_SendReceiveByte(sFLASH_DUMMY_BYTE, reg) != HAL_OK)
  {
    return HAL_ERROR;
  } 

  /* Put NSS to HIGH level */
  NSS_TO_HIGH_LEVEL
    
  return HAL_OK;

}


/**
  * @brief  Return the configuration of the QSPI memory.
  * @param  pInfo: pointer on the configuration structure
  * @retval QSPI memory status
  */
uint8_t sFLASH_GetInfo(sFLASH_Info* pInfo)
{
  /* Configure the structure with the memory configuration */
  if (sFLASH_Model == sFLASH_W25Q80DV)
  {
    pInfo->FlashSize            = FLASH_080_SIZE;
    pInfo->EraseSectorSize      = EXT_FLASH_SUBSECTOR_SIZE;
    pInfo->EraseSectorsNumber   = (FLASH_080_SIZE / EXT_FLASH_SUBSECTOR_SIZE);
    pInfo->ProgPageSize         = EXT_FLASH_PAGE_SIZE;
    pInfo->ProgPagesNumber      = (FLASH_080_SIZE / EXT_FLASH_PAGE_SIZE);
    pInfo->numReadDummy         = FLASH_DUMMY_CYCLES_READ_QUAD;
    pInfo->transactionAddress   = FLASH_TRANSACTION_080_ADD;
    pInfo->numTransactionSector = FLASH_TRANSACTION_NUM_SEC;
    return HAL_OK;
  }
  else
  {
    if (sFLASH_Model == sFLASH_SST26VF016B)
    {
      pInfo->FlashSize            = FLASH_016_SIZE;
      pInfo->EraseSectorSize      = EXT_FLASH_SUBSECTOR_SIZE;
      pInfo->EraseSectorsNumber   = (FLASH_016_SIZE / EXT_FLASH_SUBSECTOR_SIZE);
      pInfo->ProgPageSize         = EXT_FLASH_PAGE_SIZE;
      pInfo->ProgPagesNumber      = (FLASH_016_SIZE / EXT_FLASH_PAGE_SIZE);
      pInfo->numReadDummy         = FLASH_DUMMY_CYCLES_READ_QUAD;
      pInfo->transactionAddress   = FLASH_TRANSACTION_016_ADD;
      pInfo->numTransactionSector = FLASH_TRANSACTION_NUM_SEC;
      return HAL_OK;
    }
    else
    {
      if (sFLASH_Model == sFLASH_IS25LP016)
      {
        pInfo->FlashSize            = FLASH_016_SIZE;
        pInfo->EraseSectorSize      = EXT_FLASH_SUBSECTOR_SIZE;
        pInfo->EraseSectorsNumber   = (FLASH_016_SIZE / EXT_FLASH_SUBSECTOR_SIZE);
        pInfo->ProgPageSize         = EXT_FLASH_PAGE_SIZE;
        pInfo->ProgPagesNumber      = (FLASH_016_SIZE / EXT_FLASH_PAGE_SIZE);
        pInfo->numReadDummy         = FLASH_DUMMY_CYCLES_READ_QUAD;
        pInfo->transactionAddress   = FLASH_TRANSACTION_016_ADD;
        pInfo->numTransactionSector = FLASH_TRANSACTION_NUM_SEC;
        return HAL_OK;
      }
      else
      {
        if (sFLASH_Model == sFLASH_IS25LP080)
        {
          pInfo->FlashSize            = FLASH_080_SIZE;
          pInfo->EraseSectorSize      = EXT_FLASH_SUBSECTOR_SIZE;
          pInfo->EraseSectorsNumber   = (FLASH_080_SIZE / EXT_FLASH_SUBSECTOR_SIZE);
          pInfo->ProgPageSize         = EXT_FLASH_PAGE_SIZE;
          pInfo->ProgPagesNumber      = (FLASH_080_SIZE / EXT_FLASH_PAGE_SIZE);
          pInfo->numReadDummy         = FLASH_DUMMY_CYCLES_READ_QUAD;
          pInfo->transactionAddress   = FLASH_TRANSACTION_080_ADD;
          pInfo->numTransactionSector = FLASH_TRANSACTION_NUM_SEC;
          return HAL_OK;
        }
        else
        {
          if (sFLASH_Model == sFLASH_GD25Q16C)
          {
            pInfo->FlashSize            = FLASH_016_SIZE;
            pInfo->EraseSectorSize      = EXT_FLASH_SUBSECTOR_SIZE;
            pInfo->EraseSectorsNumber   = (FLASH_016_SIZE / EXT_FLASH_SUBSECTOR_SIZE);
            pInfo->ProgPageSize         = EXT_FLASH_PAGE_SIZE;
            pInfo->ProgPagesNumber      = (FLASH_016_SIZE / EXT_FLASH_PAGE_SIZE);
            pInfo->numReadDummy         = FLASH_DUMMY_CYCLES_READ_QUAD;
            pInfo->transactionAddress   = FLASH_TRANSACTION_016_ADD;
            pInfo->numTransactionSector = FLASH_TRANSACTION_NUM_SEC;
            return HAL_OK;
          }
        }
      }
    }
  }

  return HAL_ERROR;
}

static uint8_t sFLASH_GetDeviceId(uint8_t* pIdreg)
{
     
  /* Put NSS to LOW level */
  NSS_TO_LOW_LEVEL  
    
  /* Transmit command  */
  if (sFLASH_SendByte(READ_MANUFACTURER_AND_PROD_ID) != HAL_OK)
  {
    return HAL_ERROR;
  } 
      
  /* Transmit the 1st  DUMMY byte, receive Manufacturer ID*/
  if (sFLASH_SendReceiveByte(sFLASH_DUMMY_BYTE, pIdreg) != HAL_OK)
  {
    return HAL_ERROR;
  } 
    
  /* Transmit the 2nd DUMMY byte, receive the Memory Type */
  if (sFLASH_SendReceiveByte(sFLASH_DUMMY_BYTE, (pIdreg + 1)) != HAL_OK)
  {
    return HAL_ERROR;
  } 
  
  /* Transmit the 3rd DUMMY byte, receive the Capacity */
  if (sFLASH_SendReceiveByte(sFLASH_DUMMY_BYTE, (pIdreg + 2)) != HAL_OK)
  {
    return HAL_ERROR;
  } 
     
  /* Put NSS to HIGH level */
  NSS_TO_HIGH_LEVEL

  return HAL_OK;
  
}

//-----------------------------------------------------------------
// Fine routine gestione FLASH a basso livello
//-----------------------------------------------------------------

//-----------------------------------------------------------------
/*
  FlashWrite (Scrive su Flash)

  Valori passati:
    u32_t   indirizzo;
    u8_t *    buffer (buffer da scrivere);
    u32_t   lbuffer (quanti byte scrivere);
    u32_t   lbufferbackup (per ridurre i tempi indicare quanto salvare di ciascun settore)

  Valore di ritorno:
    u8_t  0x00 tutto OK
        0xFF in caso di errore;
*/
//-----------------------------------------------------------------
unsigned char FlashWrite(unsigned int Address, unsigned char *BuffWr, unsigned int LBuffWr, unsigned int LBuffBackup)
{
  // Variabile di controllo operazione su flash
  unsigned char RetErase, RetWrite;
  // Contatore di quanti byte sono stati scritti
  unsigned int BytesWritten, BytesToProcess;

