sroggerini/SCU_FW_Develop/Src/Device/ExtFlash_stm32h5.c
  Valori passati:
    nessuno
  Valore di ritorno:
    u8_t  0xFF in caso di errore;
            0x00 se tutto bene;
*/
//-----------------------------------------------------------------
unsigned char FlashFormat(void)
{
  unsigned char RetVal;
  unsigned int  sector;
  uint32_t address;

  RetVal = address = 0;

#ifdef USE_ERASE_CHIP
  RetVal = sFLASH_Erase_Chip();
#else
#ifndef ERASE_CHIP_WITH_SUBSECTORS

  /*we have 1024 64K sector (512 64K sector from 0x0200.0000=OFFSET_FLASH_ADDRESS to 0x03FF.FFFF) */
  for (sector = 0; sector < FLASH_FWFILE_NUM_64K_SECTOR; sector++)
  {
    address = OFFSET_FLASH_ADDRESS + (sector * (uint32_t)FLASH_SECTOR_64K_SIZE);
    RetVal = sFLASH_Erase_Block(address);

    if (RetVal != HAL_OK)
    {
      break;
    }
    else
    {
      refreshWD();
    }
  }

#else

  /*we have 16384 4K subsector. For the FAT we use  8192 4Ksubsector from 0x0200.0000=OFFSET_FLASH_ADDRESS to 0x03FF.FFFF */
  for (sector = 0; sector < (unsigned int)FLASH_FWFILE_NUM_SECTOR; sector++)
  {
    address = OFFSET_FLASH_ADDRESS + (sector * (uint32_t)0x1000);
    RetVal = sFLASH_Erase_SubBlock(address);

    if (RetVal != QSPI_OK)
    {
      break;
    }
    else
    {
      refreshWD();
    }
  }

#endif
#endif
  return(RetVal);
}

/*
  FlashFormat (formatta la parte di flash dedicata alla configurazione 0x0000.0000-1FFF.FFFF)

  Valori passati:
    nessuno
  Valore di ritorno:
    u8_t  0xFF in caso di errore;
            0x00 se tutto bene;
*/
//-----------------------------------------------------------------
unsigned char FlashConfigFormat(void)
{
  unsigned char RetVal;
  unsigned int  sector;
  uint32_t address;

  RetVal = address = 0;

#ifndef ERASE_CHIP_WITH_SUBSECTORS

  /*we have 1024 64K sector (512 64K sector from 0x0200.0000=OFFSET_FLASH_ADDRESS to 0x03FF.FFFF) */
  for (sector = 0; sector < FLASH_FWFILE_NUM_64K_SECTOR; sector++)
  {
    address = (uint32_t)0x00000000 + (sector * (uint32_t)FLASH_SECTOR_64K_SIZE);
    RetVal = sFLASH_Erase_Block(address);

    if (RetVal != HAL_OK)
    {
      break;
    }
    else
    {
      refreshWD();
    }
  }

#endif
  return(RetVal);
}


//-----------------------------------------------------------------
//  FATInit
//-----------------------------------------------------------------
void FATInit(void)
{
#ifdef DA_FARE
  volatile unsigned char ErrFlash, AzzFAT;
  unsigned short LookupValue;
  char          fullFileName[16] = {'\0'};
  unsigned int  readByte, byteToRead;

  LookupValue = 0;
  ErrFlash = 0;
  /* il nome del file sarà del tipo:  x00000000.dat */
  sprintf((char *)fullFileName, "x%08X.", AddressFAT);
  /*         destination       source */
  strcat((char *)fullFileName, (char *)FATCONF_EXT);

  if (FlashFatReadFile(fullFileName, NULL, &byteToRead, (uint8_t*)NULL, FAT_DEVICE_FLASH))
  {
    readByte = (unsigned int)FlashFatReadFile(fullFileName, (char *)&FAT, (unsigned int*)&byteToRead, NULL,  FAT_DEVICE_FLASH);

    if ((readByte == (unsigned int)0) || ( readByte != byteToRead))
    {
      ErrFlash = (unsigned char)0xFF;
    }
  }
  else
  {
    /* file doesn't exist */
    ErrFlash = (unsigned char)0xFF;
  }

#endif
}
//-----------------------------------------------------------------

//-----------------------------------------------------------------
//  FlashInit
//-----------------------------------------------------------------
void FlashInit(void)
{

  // Termino l'inizializzazione cominciata in MX_QUADSPI_Init()
  // La funzione MX_QUADSPI_Init() viene generata in automatico, quindi aggiungo qui le altre funzioni
 
  // Leggo l'ID della flash
  sFLASH_GetDeviceId((uint8_t*)FlashID); 
  
  // Controllo se è una flash gestita
  if (memcmp(FlashID, "\xEF\x40\x14", 3) == 0)     /* "\xEF\x40\x14"  WINBOND - W25 - 8Mb */
  {
    sFLASH_Model = sFLASH_W25Q80DV;
  }
  else
  {
    if (memcmp(FlashID, "\xEF\x40\x15", 3) == 0)    /* "\xEF\x40\x15"  W25Q16JV WINBOND - W25 - 16Mb */
    {
      sFLASH_Model = sFLASH_W25Q016DV;
    }
    else
    {
      if (memcmp(FlashID, "\x9D\x60\x14", 3) == 0)    /* "\x9D\x60\x14"  S25LP080D ISSI - LP - 8Mb */
      {
        sFLASH_Model = sFLASH_IS25LP080;
      }
      else
      {
        if (memcmp(FlashID, "\x9D\x60\x15", 3) == 0)    /* "\x9D\x60\x15"  S25LP016D ISSI - LP - 16Mb */
        {
          sFLASH_Model = sFLASH_IS25LP016;
        }
        else
        {
          if (memcmp(FlashID, "\xBF\x26\x41", 3) == 0)    /* "\xBF\x26\x41"  sFLASH_SST26VF016B Microchip - 26V - 16Mb */
          {
            sFLASH_Model = sFLASH_SST26VF016B;
          }
          else
          {
            if (memcmp(FlashID, "\xC8\x40\x15", 3) == 0)    /* "\xC8\x40\x15"  GD25Q16C GIGA DEVICE - GD25Q - 16Mb */
            {
              sFLASH_Model = sFLASH_GD25Q16C;
            }
            else
            {
              sFLASH_Model = sFLASH_UNKNOWN;
            }
          }
        }
      }
    }
  }

  if (sFLASH_Model != sFLASH_UNKNOWN)
  {
       
    if (HAL_SPI_Init(&hspi1) != HAL_OK) //  reinizializzazione modulo SPI di STM32F765
    {
      // Flash in errore, blocco tutto
      while(1);
    }
    
    // Assegno alla struttura Info i valori relativi alla QSPI in uso
    sFLASH_GetInfo(&sFLASH_Information);

    FlashDimBlk = sFLASH_Information.EraseSectorSize; // Dimensione di un sotto-settore
    FlashDimPag = sFLASH_Information.ProgPageSize; // Dimensione di una pagina
    
  }
  else
  {
    // Flash non gestita, blocco tutto
    //while(1);
  }   
  
}

/**
  * @brief  Return if  QSPI flash has been detected.
  * @param  none
  * @retval QSPI detected status
  */
uint8_t sFLASH_Detected(void)
{
  /* Configure the structure with the memory configuration */
  if ((sFLASH_Model == sFLASH_W25Q80DV) || (sFLASH_Model == sFLASH_W25Q016DV) ||
      (sFLASH_Model == sFLASH_IS25LP016) || (sFLASH_Model == sFLASH_SST26VF016B) || (sFLASH_Model == sFLASH_IS25LP080) ||
      (sFLASH_Model == sFLASH_GD25Q16C))
  {
    return HAL_OK;
  }
  else
  {
    return HAL_ERROR;
  }

}

/**
  * @brief  Erases the specified sub-block of the QSPI memory.
  * @param  BlockAddress: Block address to erase
  * @retval QSPI memory status
  */
uint8_t raw_sFLASH_Erase_SubBlock(uint32_t BlockAddress)
{
  return(sFLASH_Erase_SubBlock(BlockAddress));
}

/**
  * @brief  Writes an amount of data to the QSPI memory.
  * @param  pData: Pointer to data to be written
  * @param  WriteAddr: Write start address
  * @param  Size: Size of data to write
  * @retval QSPI memory status
  */
uint8_t raw_sFLASH_Write(uint8_t* pData, uint32_t WriteAddr, uint32_t Size)
{
  refreshWD();
  return(sFLASH_Write(pData, WriteAddr, Size));
}

/**
  * @brief  Reads an amount of data to the QSPI memory.
  * @param  pData: Pointer where data read is stored
  * @param  ReadAddr: Read start address
  * @param  Size: Size of data to read
  * @retval QSPI memory status
  */
uint8_t raw_sFLASH_Read(uint8_t* pData, uint32_t ReadAddr, uint32_t Size)
{
  return(sFLASH_Read(pData, ReadAddr, Size));
}

/**
  * @brief  Erase data area in QSPI-Flash.
  * @retval QSPI memory status
  */
uint8_t raw_sFLASH_EraseDataArea(void)
{
  uint32_t      qspiAdd;
  uint8_t       result;
  osSemaphoreId semaphoreFat;

  semaphoreFat = getFatSemaphore();

  if(osSemaphoreAcquire(semaphoreFat, portMAX_DELAY) == osOK)
  {
    for (qspiAdd = FLASH_FWFILE_SIZE; qspiAdd < sFLASH_Information.FlashSize; qspiAdd += EXT_FLASH_SUBSECTOR_SIZE)
    {
      result = raw_sFLASH_Erase_SubBlock(qspiAdd);
      refreshWD();

      if (result != HAL_OK)
      {
        break;
      }
    }
  }

  osSemaphoreRelease(semaphoreFat);
  return(result);
}

/**
  * @brief  Erase data area in QSPI-Flash.
  * @param  none
  * @retval char*: pointer to start address data area in QSPI flash
  */
char* pQspiDataArea(void)
{
  return((char*)FLASH_FWFILE_SIZE);
}


uint8_t getStatusReg(void)
{
  uint8_t statusReg;

  sFLASH_GetStatusReg1(&statusReg);
  return (statusReg);
}

uint8_t getConfigReg(void)
{
  uint8_t configReg;

  sFLASH_GetConfigReg1(&configReg);
  return (configReg);
}


/**
  * @brief  Get address transaction start area
  * @param  none
  * @retval uint32_t: pointer to start address transaction data area in QSPI flash
  */
uint32_t getTransactionAddress(void)
{
  return (sFLASH_Information.transactionAddress);
}

//-----------------------------------------------------------------

